
var position = [
{"編號":"1","鄉鎮":"金城鎮","地址":"金城車站前（7-11旁）","型式":"地上式",經度:118.320395376908,緯度:24.433083239962,流量:1106}
,
{"編號":"2","鄉鎮":"金城鎮","地址":"民生路大成飯店前","型式":"地下式",經度:118.319741674866,緯度:24.434401914827,流量:326}
,
{"編號":"3","鄉鎮":"金城鎮","地址":"民生路34號（土地銀行旁）","型式":"地上式",經度:118.319403337432,緯度:24.435078173197,流量:1241}
,
{"編號":"4","鄉鎮":"金城鎮","地址":"縣政府後方廚房旁","型式":"地下式",經度:118.319900021838,緯度:24.437129185878,流量:313}
,
{"編號":"5","鄉鎮":"金城鎮","地址":"金城新莊6巷及富康一村8巷路口","型式":"地下式",經度:118.320955915477,緯度:24.438275781341,流量:1011}
,
{"編號":"6","鄉鎮":"金城鎮","地址":"環島北路38巷(文化局後)","型式":"地上式",經度:118.32418,緯度:24.44122,流量:575}
,
{"編號":"7","鄉鎮":"金城鎮","地址":"環島西路青年活動中心車棚對面","型式":"地上式",經度:118.320567925272,緯度:24.441112823088,流量:491}
,
{"編號":"8","鄉鎮":"金城鎮","地址":"民權路永豐銀行旁","型式":"地上式",經度:118.320748014697,緯度:24.439786783591,流量:800}
,
{"編號":"9","鄉鎮":"金城鎮","地址":"民權路摩斯漢堡旁","型式":"地上式",經度:118.320182998519,緯度:24.439366129136,流量:1117}
,
{"編號":"10","鄉鎮":"金城鎮","地址":"翔豐段愛家公園左側","型式":"地上式",經度:118.319410612253,緯度:24.440061201363,流量:1357}
,
{"編號":"11","鄉鎮":"金城鎮","地址":"翔豐段愛家公園右側","型式":"地上式",經度:118.318616988060,緯度:24.439953708822,流量:1072}
,
{"編號":"12","鄉鎮":"金城鎮","地址":"民生路75號旁（台灣銀行自動櫃員機前）","型式":"地上式",經度:118.318621723876,緯度:24.436430124384,流量:1135}
,
{"編號":"13","鄉鎮":"金城鎮","地址":"法院服務中心前","型式":"地上式",經度:118.318133624640,緯度:24.437536641710,流量:1678}
,
{"編號":"14","鄉鎮":"金城鎮","地址":"珠浦西路84巷1號旁（鳳翔社區內）","型式":"地上式",經度:118.315359620709,緯度:24.438070705690,流量:1383}
,
{"編號":"15","鄉鎮":"金城鎮","地址":"珠浦西路92巷17號右後方（鳳翔社區內）","型式":"地上式",經度:118.314980445444,緯度:24.439490727566,流量:404}
,
{"編號":"16","鄉鎮":"金城鎮","地址":"民權路70巷6弄26號後方（棒球場往省政府方向內）","型式":"地上式",經度:118.311279536810,緯度:24.434161115949,流量:560}
,
{"編號":"17","鄉鎮":"金城鎮","地址":"民權路70巷4弄13-1號旁（安和新莊內）","型式":"地上式",經度:118.312182677953,緯度:24.433414764732,流量:784}
,
{"編號":"18","鄉鎮":"金城鎮","地址":"民權路70巷8弄5號前（安和新莊一代養生館旁）","型式":"地上式",經度:118.313068545883,緯度:24.433761606842,流量:812}
,
{"編號":"19","鄉鎮":"金城鎮","地址":"民權路68號前（物資處大門右側）","型式":"地下式",經度:118.313897958689,緯度:24.432477435602,流量:896}
,
{"編號":"20","鄉鎮":"金城鎮","地址":"民權路32號(金城國中側門)","型式":"地上式",經度:118.31359,緯度:24.43137,流量:800}
,
{"編號":"21","鄉鎮":"金城鎮","地址":"民權路119號斜對面 (一家人麵包斜對面)","型式":"地上式",經度:118.31577,緯度:24.43431,流量:939}
,
{"編號":"22","鄉鎮":"金城鎮","地址":"民權路154號斜對面(民權路國民黨部斜對面)","型式":"地上式",經度:118.31738,緯度:24.43601,流量:1394}
,
{"編號":"23","鄉鎮":"金城鎮","地址":"中興路173巷13號前（傅錫琪紀念館左前方）","型式":"地下式",經度:118.318810140195,緯度:24.434621091881,流量:771}
,
{"編號":"24","鄉鎮":"金城鎮","地址":"北帝廟左側路口","型式":"地下式",經度:118.318890348954,緯度:24.433954055877,流量:1195}
,
{"編號":"25","鄉鎮":"金城鎮","地址":"中興路99號前","型式":"地下式",經度:118.317892325679,緯度:24.433352405139,流量:1296}
,
{"編號":"26","鄉鎮":"金城鎮","地址":"珠浦北路朱子祠對面巷口","型式":"地下式",經度:118.316833140366,緯度:24.434129145000,流量:1024}
,
{"編號":"27","鄉鎮":"金城鎮","地址":"莒光路165號（全頻消防器材行前）","型式":"地下式",經度:118.316182298168,緯度:24.433629539219,流量:956}
,
{"編號":"28","鄉鎮":"金城鎮","地址":"中興路、莒光路口（陳氏宗祠前）","型式":"地下式",經度:118.316897652307,緯度:24.432734782366,流量:1084}
,
{"編號":"29","鄉鎮":"金城鎮","地址":"中興路1號福德宮前","型式":"地下式",經度:118.316297738534,緯度:24.432210217139,流量:1032}
,
{"編號":"30","鄉鎮":"金城鎮","地址":"光前路74號右側","型式":"地下式",經度:118.315090444245,緯度:24.433075929894,流量:976}
,
{"編號":"31","鄉鎮":"金城鎮","地址":"民族路212號","型式":"地下式",經度:118.316185490889,緯度:24.430275774921,流量:794}
,
{"編號":"32","鄉鎮":"金城鎮","地址":"珠浦南路35號","型式":"地下式",經度:118.315595835178,緯度:24.431270231965,流量:389}
,
{"編號":"33","鄉鎮":"金城鎮","地址":"代天府(民族路66號金香特產旁)","型式":"地下式",經度:118.319389492625,緯度:24.430491650395,流量:1112}
,
{"編號":"34","鄉鎮":"金城鎮","地址":"莒光路30號","型式":"地下式",經度:118.317940480388,緯度:24.431971691499,流量:612}
,
{"編號":"35","鄉鎮":"金城鎮","地址":"國慶大飯店前","型式":"地上式",經度:118.321408079028,緯度:24.427330938556,流量:952}
,
{"編號":"36","鄉鎮":"金城鎮","地址":"燦坤賣場旁","型式":"地上式",經度:118.321518143022,緯度:24.428619008105,流量:404}
,
{"編號":"37","鄉鎮":"金城鎮","地址":"警察局大門左側","型式":"地上式",經度:118.322297998493,緯度:24.428965230558,流量:986}
,
{"編號":"38","鄉鎮":"金城鎮","地址":"庵前牧馬候祠右前方（庵前41-2號右前方）","型式":"地上式",經度:118.321934553854,緯度:24.420193526900,流量:342}
,
{"編號":"39","鄉鎮":"金城鎮","地址":"庵前30號前","型式":"地上式",經度:118.321165742617,緯度:24.419580916884,流量:1879}
,
{"編號":"40","鄉鎮":"金城鎮","地址":"庵前百姓公祠前","型式":"地上式",經度:118.320356164106,緯度:24.419548482281,流量:284}
,
{"編號":"41","鄉鎮":"金城鎮","地址":"賢庵國小大門左側","型式":"地上式",經度:118.318612890339,緯度:24.418046310910,流量:937}
,
{"編號":"42","鄉鎮":"金城鎮","地址":"官裏仰雲殿金爐旁","型式":"地下式",經度:118.316922707272,緯度:24.411945339600,流量:450}
,
{"編號":"43","鄉鎮":"金城鎮","地址":"吳厝村牌後方25公尺處","型式":"地上式",經度:118.317201401728,緯度:24.419761805359,流量:1280}
,
{"編號":"44","鄉鎮":"金城鎮","地址":"西海路三段43號(金城消防分隊)","型式":"地上式",經度:118.310911000000,緯度:24.420185000000,流量:622}
,
{"編號":"45","鄉鎮":"金城鎮","地址":"賢厝廟口旁","型式":"地上式",經度:118.311392644724,緯度:24.416268216201,流量:1113}
,
{"編號":"46","鄉鎮":"金城鎮","地址":"賢厝三角公園旁（電線桿旁）","型式":"地下式",經度:118.308755545751,緯度:24.416947881386,流量:366}
,
{"編號":"47","鄉鎮":"金城鎮","地址":"賢厝往后豐港(電力公司招牌旁)","型式":"地上式",經度:118.308015841518,緯度:24.418047079950,流量:1124}
,
{"編號":"48","鄉鎮":"金城鎮","地址":"水頭村公所左側","型式":"地上式",經度:118.296812284304,緯度:24.411944995563,流量:1037}
,
{"編號":"49","鄉鎮":"金城鎮","地址":"金門城十字路口（高梁文化中心前）","型式":"地上式",經度:118.307456279634,緯度:24.402970279078,流量:810}
,
{"編號":"50","鄉鎮":"金城鎮","地址":"金門城十字路口164之3號左前方","型式":"地上式",經度:118.307174586507,緯度:24.402719709146,流量:861}
,
{"編號":"51","鄉鎮":"金城鎮","地址":"金門城舊街151之1號右前方25公尺","型式":"地上式",經度:118.309072400825,緯度:24.404114370420,流量:1147}
,
{"編號":"52","鄉鎮":"金城鎮","地址":"大古崗70之1號左側","型式":"地上式",經度:118.314286664060,緯度:24.400329146187,流量:1208}
,
{"編號":"53","鄉鎮":"金城鎮","地址":"古崗石刻站牌對面路口","型式":"地上式",經度:118.316969416233,緯度:24.399523632400,流量:1078}
,
{"編號":"54","鄉鎮":"金城鎮","地址":"古崗公車亭旁","型式":"地上式",經度:118.315910293070,緯度:24.398053136270,流量:1012}
,
{"編號":"55","鄉鎮":"金城鎮","地址":"珠山村內大池塘旁","型式":"地下式",經度:118.320757583771,緯度:24.402117275235,流量:985}
,
{"編號":"56","鄉鎮":"金城鎮","地址":"東沙往歐厝叉路口","型式":"地下式",經度:118.325166628671,緯度:24.404085558146,流量:1033}
,
{"編號":"57","鄉鎮":"金城鎮","地址":"歐厝村內池塘旁","型式":"地上式",經度:118.330648079704,緯度:24.406981281188,流量:505}
,
{"編號":"58","鄉鎮":"金城鎮","地址":"歐厝村口石刻站牌右側","型式":"地上式",經度:118.331016686748,緯度:24.408729961166,流量:956}
,
{"編號":"59","鄉鎮":"金城鎮","地址":"和平社區十字路口（活動中心左側）","型式":"地上式",經度:118.328451133465,緯度:24.415205167616,流量:1132}
,
{"編號":"60","鄉鎮":"金城鎮","地址":"和平社區十字路口（活動中心右側）","型式":"地上式",經度:118.328681017633,緯度:24.414600814573,流量:1123}
,
{"編號":"61","鄉鎮":"金城鎮","地址":"和平社區44號旁","型式":"地上式",經度:118.327585375749,緯度:24.414595951727,流量:785}
,
{"編號":"62","鄉鎮":"金城鎮","地址":"和平社區6號旁","型式":"地上式",經度:118.326983985183,緯度:24.414022486375,流量:602}
,
{"編號":"63","鄉鎮":"金城鎮","地址":"民族路108巷14號前(魁星樓附近)","型式":"地下式",經度:118.317392,緯度:24.431236,流量:1096}
,
{"編號":"64","鄉鎮":"金城鎮","地址":"許氏家廟旁","型式":"地下式",經度:118.3161939,緯度:24.431442994490,流量:1198}
,
{"編號":"1","鄉鎮":"金湖鎮","地址":"金湖分隊右前方路燈旁","型式":"地上式",經度:118.425060595618,緯度:24.443284592060,流量:519}
,
{"編號":"2","鄉鎮":"金湖鎮","地址":"金湖鎮綜合體育館旁","型式":"地上式",經度:118.426943621978,緯度:24.444710155400,流量:395}
,
{"編號":"3","鄉鎮":"金湖鎮","地址":"下莊恩主公廟前","型式":"地上式",經度:118.427897780713,緯度:24.450992811453,流量:697}
,
{"編號":"4","鄉鎮":"金湖鎮","地址":"黃海路97號前","型式":"地上式",經度:118.415913000000,緯度:24.444817000000,流量:1093}
,
{"編號":"5","鄉鎮":"金湖鎮","地址":"黃海路71號前","型式":"地上式",經度:118.415543000000,緯度:24.444341000000,流量:1093}
,
{"編號":"6","鄉鎮":"金湖鎮","地址":"山外村76-1號旁","型式":"地上式",經度:118.415264752507,緯度:24.444898304070,流量:1052}
,
{"編號":"7","鄉鎮":"金湖鎮","地址":"山外村113號前","型式":"地上式",經度:118.413071548891,緯度:24.444608473174,流量:1067}
,
{"編號":"8","鄉鎮":"金湖鎮","地址":"山外村18-1號前","型式":"地上式",經度:118.413906497459,緯度:24.444315117031,流量:1057}
,
{"編號":"9","鄉鎮":"金湖鎮","地址":"金湖國小大門對面黃海路37號前","型式":"地上式",經度:118.415078112661,緯度:24.443431856671,流量:1255}
,
{"編號":"10","鄉鎮":"金湖鎮","地址":"復興路中華電信旁","型式":"地下式",經度:118.417079585244,緯度:24.440802106894,流量:983}
,
{"編號":"11","鄉鎮":"金湖鎮","地址":"衛生行政大樓右前方防火巷入口處","型式":"地下式",經度:118.416871553785,緯度:24.440487917257,流量:987}
,
{"編號":"12","鄉鎮":"金湖鎮","地址":"中正路自強路口源宏書局前","型式":"地下式",經度:118.415598292171,緯度:24.440944372159,流量:865}
,
{"編號":"13","鄉鎮":"金湖鎮","地址":"新市籃球場旁","型式":"地上式",經度:118.414668000000,緯度:24.441836000000,流量:983}
,
{"編號":"14","鄉鎮":"金湖鎮","地址":"太湖路202號旁(昇恆昌對面)","型式":"地上式",經度:118.418217450424,緯度:24.438944398608,流量:768}
,
{"編號":"15","鄉鎮":"金湖鎮","地址":"金門監獄旁","型式":"地上式",經度:118.420001734980,緯度:24.442175507341,流量:583}
,
{"編號":"16","鄉鎮":"金湖鎮","地址":"復興路2-1號","型式":"地上式",經度:118.418799163730,緯度:24.440785881296,流量:1268}
,
{"編號":"17","鄉鎮":"金湖鎮","地址":"榕園入口處靠太湖旁","型式":"地上式",經度:118.429470392970,緯度:24.441675301911,流量:1432}
,
{"編號":"18","鄉鎮":"金湖鎮","地址":"TP15","型式":"地上式",經度:118.407506771417,緯度:24.445762586925,流量:405}
,
{"編號":"19","鄉鎮":"金湖鎮","地址":"鑑潭","型式":"地上式",經度:118.410062009340,緯度:24.451186744015,流量:602}
,
{"編號":"20","鄉鎮":"金湖鎮","地址":"TP16","型式":"地上式",經度:118.403950922460,緯度:24.448915529838,流量:937}
,
{"編號":"21","鄉鎮":"金湖鎮","地址":"太武山公墓牌圓環附近機車停車處","型式":"地上式",經度:118.403054001044,緯度:24.456196812485,流量:1379}
,
{"編號":"22","鄉鎮":"金湖鎮","地址":"太湖路國父銅像圓環往小徑路口","型式":"地上式",經度:118.395637911676,緯度:24.453485191227,流量:215}
,
{"編號":"23","鄉鎮":"金湖鎮","地址":"小徑特約茶室停車場前","型式":"地上式",經度:118.384433132737,緯度:24.448195218236,流量:332}
,
{"編號":"24","鄉鎮":"金湖鎮","地址":"小徑T字路口","型式":"地上式",經度:118.384182183807,緯度:24.448283941819,流量:1807}
,
{"編號":"25","鄉鎮":"金湖鎮","地址":"瓊林610號旁靠近環島北路路口","型式":"地上式",經度:118.370822536895,緯度:24.455706340085,流量:861}
,
{"編號":"26","鄉鎮":"金湖鎮","地址":"瓊林兒童公園路旁(瓊林寄民宿旁)","型式":"地上式",經度:118.374856219006,緯度:24.454816060084,流量:1029}
,
{"編號":"27","鄉鎮":"金湖鎮","地址":"瓊林養拙樓旁(民防坑道對面)","型式":"地上式",經度:118.372678787993,緯度:24.455048125154,流量:912}
,
{"編號":"28","鄉鎮":"金湖鎮","地址":"瓊林82-1號右前路口(老人會對面)","型式":"地上式",經度:118.373762765592,緯度:24.453757707155,流量:835}
,
{"編號":"29","鄉鎮":"金湖鎮","地址":"瓊林一公車亭旁","型式":"地上式",經度:118.374381637942,緯度:24.452090233287,流量:714}
,
{"編號":"30","鄉鎮":"金湖鎮","地址":"尚義三角圓環旁","型式":"地上式",經度:118.375448056375,緯度:24.437381271411,流量:357}
,
{"編號":"31","鄉鎮":"金湖鎮","地址":"尚義公車亭旁","型式":"地上式",經度:118.377544428970,緯度:24.437562902044,流量:342}
,
{"編號":"32","鄉鎮":"金湖鎮","地址":"成功公車亭旁","型式":"地上式",經度:118.391473513200,緯度:24.440565918359,流量:812}
,
{"編號":"33","鄉鎮":"金湖鎮","地址":"成功往金門日報T字路口","型式":"地上式",經度:118.390453465127,緯度:24.439784077417,流量:1552}
,
{"編號":"34","鄉鎮":"金湖鎮","地址":"成功往正義國小路口涼亭旁","型式":"地上式",經度:118.389293780583,緯度:24.438592845651,流量:983}
,
{"編號":"35","鄉鎮":"金湖鎮","地址":"成功正義國小前叉路口","型式":"地上式",經度:118.388442731317,緯度:24.438908482246,流量:1115}
,
{"編號":"36","鄉鎮":"金湖鎮","地址":"夏興公車亭旁","型式":"地上式",經度:118.394791905159,緯度:24.439033695217,流量:1467}
,
{"編號":"37","鄉鎮":"金湖鎮","地址":"舊花崗石醫院路口前","型式":"地上式",經度:118.399371844711,緯度:24.442462100245,流量:509}
,
{"編號":"38","鄉鎮":"金湖鎮","地址":"新頭99號前(俊輝炭烤)","型式":"地上式",經度:118.419067177126,緯度:24.433822040894,流量:987}
,
{"編號":"39","鄉鎮":"金湖鎮","地址":"新頭公車亭旁","型式":"地上式",經度:118.419908000000,緯度:24.433753000000,流量:1066}
,
{"編號":"40","鄉鎮":"金湖鎮","地址":"金港路(往兩棲偵察營段路段)","型式":"地上式",經度:118.433867368238,緯度:24.423284970729,流量:778}
,
{"編號":"41","鄉鎮":"金湖鎮","地址":"料羅村新興街候公車亭旁","型式":"地下式",經度:118.434653681152,緯度:24.416568937923,流量:"無水"}
,
{"編號":"42","鄉鎮":"金湖鎮","地址":"料羅新村昆庭風墅旁","型式":"地上式",經度:118.436857371178,緯度:24.420389686713,流量:841}
,
{"編號":"43","鄉鎮":"金湖鎮","地址":"料羅碼頭港務大樓旁","型式":"地上式",經度:118.428637572171,緯度:24.407854872550,流量:742}
,
{"編號":"44","鄉鎮":"金湖鎮","地址":"新塘三角圓環靠通信營路口","型式":"地下式",經度:118.439646000000,緯度:24.422469000000,流量:"無水"}
,
{"編號":"45","鄉鎮":"金湖鎮","地址":"農會瓦斯行對面馬路","型式":"地上式",經度:118.432182628951,緯度:24.433998236462,流量:"無水"}
,
{"編號":"46","鄉鎮":"金湖鎮","地址":"環島東路西村十字路口","型式":"地上式",經度:118.442140236573,緯度:24.430167531438,流量:730}
,
{"編號":"47","鄉鎮":"金湖鎮","地址":"庵邊公車亭旁","型式":"地上式",經度:118.443028219962,緯度:24.424784543257,流量:310}
,
{"編號":"48","鄉鎮":"金湖鎮","地址":"峰上18號旁(遊戲區)","型式":"地上式",經度:118.457963676765,緯度:24.427872499064,流量:280}
,
{"編號":"49","鄉鎮":"金湖鎮","地址":"下湖42-1號前","型式":"地上式",經度:118.455422474584,緯度:24.438899360659,流量:340}
,
{"編號":"50","鄉鎮":"金湖鎮","地址":"溪邊79號旁","型式":"地上式",經度:118.460058790000,緯度:24.442355580000,流量:460}
,
{"編號":"51","鄉鎮":"金湖鎮","地址":"后壟公車亭旁","型式":"地上式",經度:118.443724532719,緯度:24.450837158857,流量:648}
,
{"編號":"52","鄉鎮":"金湖鎮","地址":"建華6號前","型式":"地下式",經度:118.433384476048,緯度:24.449491313183,流量:160}
,
{"編號":"53","鄉鎮":"金湖鎮","地址":"建華6號前","型式":"地上式",經度:118.433233742214,緯度:24.449386917650,流量:890}
,
{"編號":"54","鄉鎮":"金湖鎮","地址":"塔后藝耕咖啡旁道路 (塔后69號旁)","型式":"地上式",經度:118.407848792658,緯度:24.441417674920,流量:443}
,
{"編號":"55","鄉鎮":"金湖鎮","地址":"塔后往漁村路口旁","型式":"地上式",經度:118.407231689451,緯度:24.437771349726,流量:1247}
,
{"編號":"56","鄉鎮":"金湖鎮","地址":"環島南路后園石頭牌前","型式":"地上式",經度:118.402333690000,緯度:24.437767740000,流量:1027}
,
{"編號":"57","鄉鎮":"金湖鎮","地址":"信義新村70號前","型式":"地下式",經度:118.408602805095,緯度:24.435195037718,流量:315}
,
{"編號":"58","鄉鎮":"金湖鎮","地址":"新湖漁港漁會大樓右側精神石碑旁碼頭","型式":"地上式",經度:118.409903772025,緯度:24.431723237542,流量:912}
,
{"編號":"59","鄉鎮":"金湖鎮","地址":"新湖漁港漁會大樓左側冷凍庫旁碼頭","型式":"地上式",經度:118.4110176615,緯度:24.4312951909,流量:1280}
,
{"編號":"60","鄉鎮":"金湖鎮","地址":"星宿王朝前港路37號旁","型式":"地上式",經度:118.414849860520,緯度:24.434430225784,流量:1396}
,
{"編號":"61","鄉鎮":"金湖鎮","地址":"湖前58號旁","型式":"地上式",經度:118.411460562062,緯度:24.435626741227,流量:1315}
,
{"編號":"62","鄉鎮":"金湖鎮","地址":"重劃區（湖前段）（三媽臭臭鍋前停車場）","型式":"地上式",經度:118.413258742747,緯度:24.439111057409,流量:1205}
,
{"編號":"63","鄉鎮":"金湖鎮","地址":"重劃區（湖前段）（市港路上金合成建設大樓旁）","型式":"地上式",經度:118.411768196667,緯度:24.438317781471,流量:879}
,
{"編號":"64","鄉鎮":"金湖鎮","地址":"重劃區（湖前段） (停車場旁)","型式":"地上式",經度:118.411891659061,緯度:24.437427395327,流量:689}
,
{"編號":"65","鄉鎮":"金湖鎮","地址":"重劃區（塔后段）（塔后風獅爺旁）","型式":"地上式",經度:118.411849366446,緯度:24.439783732903,流量:601}
,
{"編號":"66","鄉鎮":"金湖鎮","地址":"重劃區（塔后段） (遊覽車停車場旁)","型式":"地上式",經度:118.411367874125,緯度:24.439362294345,流量:1257}
,
{"編號":"67","鄉鎮":"金湖鎮","地址":"重劃區（塔后段）遊戲區旁 (金閣會館前)","型式":"地上式",經度:118.411008759566,緯度:24.438286114998,流量:1147}
,
{"編號":"68","鄉鎮":"金湖鎮","地址":"重劃區（塔后段）福德宮旁 (金閣會館前)","型式":"地上式",經度:118.410462557447,緯度:24.438272520795,流量:1239}
,
{"編號":"69","鄉鎮":"金湖鎮","地址":"重劃區（塔后段）京門大樓旁","型式":"地上式",經度:118.412023636667,緯度:24.441462763095,流量:1236}
,
{"編號":"70","鄉鎮":"金湖鎮","地址":"重劃區（塔后段)  全聯停車場旁","型式":"地上式",經度:118.411362629930,緯度:24.441851046235,流量:1567}
,
{"編號":"71","鄉鎮":"金湖鎮","地址":"新市圓環武德新莊旁","型式":"地上式",經度:118.413095850785,緯度:24.440403612386,流量:1762}
,
{"編號":"72","鄉鎮":"金湖鎮","地址":"新市圓環武德新莊旁花圃內","型式":"地下式",經度:118.413083706252,緯度:24.440300095874,流量:1747}
,
{"編號":"73","鄉鎮":"金湖鎮","地址":"金湖安豐驗車廠旁","型式":"地上式",經度:118.416365200000,緯度:24.438577400000,流量:1127}
,
{"編號":"1","鄉鎮":"金沙鎮","地址":"青嶼34之1號左前方","型式":"地上式",經度:118.421158306089,緯度:24.519941448367,流量:1020}
,
{"編號":"2","鄉鎮":"金沙鎮","地址":"官澳78號西側","型式":"地上式",經度:118.414007557501,緯度:24.519346849322,流量:1230}
,
{"編號":"3","鄉鎮":"金沙鎮","地址":"官澳長青會前","型式":"地上式",經度:118.412182321084,緯度:24.519402047941,流量:1100}
,
{"編號":"4","鄉鎮":"金沙鎮","地址":"官澳36-1號前","型式":"地上式",經度:118.413604120713,緯度:24.516990068170,流量:1250}
,
{"編號":"5","鄉鎮":"金沙鎮","地址":"環島北路靠述美國小路段","型式":"地上式",經度:118.412693366715,緯度:24.510856972474,流量:1480}
,
{"編號":"6","鄉鎮":"金沙鎮","地址":"浯坑石牌對面","型式":"地上式",經度:118.412470817981,緯度:24.501905901593,流量:1300}
,
{"編號":"7","鄉鎮":"金沙鎮","地址":"文化館、風獅爺旁","型式":"地上式",經度:118.405792444520,緯度:24.508939001883,流量:820}
,
{"編號":"8","鄉鎮":"金沙鎮","地址":"西園77號前","型式":"地上式",經度:118.403333371653,緯度:24.509555799665,流量:790}
,
{"編號":"9","鄉鎮":"金沙鎮","地址":"西園30-1號前","型式":"地上式",經度:118.404871308772,緯度:24.511136648469,流量:720}
,
{"編號":"10","鄉鎮":"金沙鎮","地址":"沙青路351號旁","型式":"地上式",經度:118.411614290000,緯度:24.496879320000,流量:705}
,
{"編號":"11","鄉鎮":"金沙鎮","地址":"文化園區路口","型式":"地上式",經度:118.403769143788,緯度:24.497085333278,流量:690}
,
{"編號":"12","鄉鎮":"金沙鎮","地址":"榮湖欣欣亭旁","型式":"地上式",經度:118.408175720181,緯度:24.487768462367,流量:1005}
,
{"編號":"13","鄉鎮":"金沙鎮","地址":"榮湖淨水場外","型式":"地上式",經度:118.409476391034,緯度:24.489219406220,流量:1010}
,
{"編號":"14","鄉鎮":"金沙鎮","地址":"榮湖虎嘯橋旁","型式":"地上式",經度:118.412565985479,緯度:24.485562105889,流量:1150}
,
{"編號":"15","鄉鎮":"金沙鎮","地址":"榮湖環島東路靠后浦頭路口","型式":"地上式",經度:118.416113736643,緯度:24.486483244667,流量:1040}
,
{"編號":"16","鄉鎮":"金沙鎮","地址":"汶沙里公所對面","型式":"地上式",經度:118.414023695097,緯度:24.488409547460,流量:680}
,
{"編號":"17","鄉鎮":"金沙鎮","地址":"忠孝新村94號左後側","型式":"地上式",經度:118.413743115456,緯度:24.492536373002,流量:850}
,
{"編號":"18","鄉鎮":"金沙鎮","地址":"忠孝新村忠孝橋旁","型式":"地上式",經度:118.412767392020,緯度:24.493818898157,流量:1100}
,
{"編號":"19","鄉鎮":"金沙鎮","地址":"英坑3之1 號前","型式":"地上式",經度:118.418665461304,緯度:24.495026100797,流量:650}
,
{"編號":"20","鄉鎮":"金沙鎮","地址":"忠孝新村沙青路路口","型式":"地上式",經度:118.411883592125,緯度:24.494064740663,流量:1000}
,
{"編號":"21","鄉鎮":"金沙鎮","地址":"金沙消防分隊前","型式":"地上式",經度:118.411759918590,緯度:24.494901849354,流量:1100}
,
{"編號":"22","鄉鎮":"金沙鎮","地址":"勝利路7號前","型式":"地上式",經度:118.412899395682,緯度:24.491206962636,流量:1080}
,
{"編號":"23","鄉鎮":"金沙鎮","地址":"環島北路往洋山路段","型式":"地上式",經度:118.400933334996,緯度:24.487589674157,流量:1060}
,
{"編號":"24","鄉鎮":"金沙鎮","地址":"洋山石牌前","型式":"地上式",經度:118.398732949627,緯度:24.489451942325,流量:1020}
,
{"編號":"25","鄉鎮":"金沙鎮","地址":"洋山80號左前側","型式":"地上式",經度:118.396441559415,緯度:24.487069978764,流量:1150}
,
{"編號":"26","鄉鎮":"金沙鎮","地址":"洋山海邊籃球場旁","型式":"地上式",經度:118.395680999521,緯度:24.491033501671,流量:880}
,
{"編號":"27","鄉鎮":"金沙鎮","地址":"后宅1之1號旁","型式":"地上式",經度:118.394749127460,緯度:24.481033408604,流量:880}
,
{"編號":"28","鄉鎮":"金沙鎮","地址":"劉澳11-1號旁","型式":"地上式",經度:118.388813699590,緯度:24.482210776931,流量:1050}
,
{"編號":"29","鄉鎮":"金沙鎮","地址":"浦山里里公所前","型式":"地上式",經度:118.390698942787,緯度:24.480237141089,流量:650}
,
{"編號":"30","鄉鎮":"金沙鎮","地址":"何浦國小後方候車亭旁","型式":"地上式",經度:118.396233102361,緯度:24.477950545552,流量:700}
,
{"編號":"31","鄉鎮":"金沙鎮","地址":"象山金剛寺前","型式":"地上式",經度:118.388368947020,緯度:24.460203918901,流量:750}
,
{"編號":"32","鄉鎮":"金沙鎮","地址":"高陽路往高坑Y型叉路口旁","型式":"地上式",經度:118.398464267684,緯度:24.469264728791,流量:700}
,
{"編號":"33","鄉鎮":"金沙鎮","地址":"斗門公車亭對面","型式":"地上式",經度:118.401016019139,緯度:24.473333080942,流量:850}
,
{"編號":"34","鄉鎮":"金沙鎮","地址":"台金大飯店對面","型式":"地上式",經度:118.389974989124,緯度:24.466999983254,流量:1000}
,
{"編號":"35","鄉鎮":"金沙鎮","地址":"高陽路與后水頭十字路口旁","型式":"地上式",經度:118.428681446343,緯度:24.477658428651,流量:750}
,
{"編號":"36","鄉鎮":"金沙鎮","地址":"太武社區5號對面環島東路上","型式":"地下式",經度:118.428116615821,緯度:24.477624691291,流量:750}
,
{"編號":"37","鄉鎮":"金沙鎮","地址":"陽翟往碧山十字路旁","型式":"地上式",經度:118.428663546163,緯度:24.477777449712,流量:650}
,
{"編號":"38","鄉鎮":"金沙鎮","地址":"蔡厝十字路口","型式":"地上式",經度:118.4165995111,緯度:24.4731574067,流量:680}
,
{"編號":"39","鄉鎮":"金沙鎮","地址":"屏東交管哨前","型式":"地上式",經度:118.432841610986,緯度:24.470770469598,流量:600}
,
{"編號":"40","鄉鎮":"金沙鎮","地址":"碧山69之1號旁（公車亭）","型式":"地上式",經度:118.439659968070,緯度:24.485908005043,流量:760}
,
{"編號":"41","鄉鎮":"金沙鎮","地址":"山后78號旁（樂天便利商店）","型式":"地上式",經度:118.439849482048,緯度:24.503194708076,流量:980}
,
{"編號":"42","鄉鎮":"金沙鎮","地址":"山西50號前T字路口旁","型式":"地上式",經度:118.429532835743,緯度:24.503225508695,流量:680}
,
{"編號":"43","鄉鎮":"金沙鎮","地址":"西山前村入口道路旁","型式":"地上式",經度:118.428119928467,緯度:24.492082009304,流量:800}
,
{"編號":"44","鄉鎮":"金沙鎮","地址":"東山前村10號前","型式":"地上式",經度:118.430468989744,緯度:24.492679015673,流量:1000}
,
{"編號":"45","鄉鎮":"金沙鎮","地址":"八二三紀念碑旁","型式":"地上式",經度:118.436811166944,緯度:24.464962142355,流量:900}
,
{"編號":"46","鄉鎮":"金沙鎮","地址":"環島東路與埔華十字路口","型式":"地上式",經度:118.446455655791,緯度:24.454199109524,流量:1000}
,
{"編號":"47","鄉鎮":"金沙鎮","地址":"內洋36號前","型式":"地上式",經度:118.453010877079,緯度:24.462062731494,流量:1250}
,
{"編號":"48","鄉鎮":"金沙鎮","地址":"保生新村(金沙消防分隊旁重劃區內,104年2月新增)","型式":"地上式",經度:118.414013800652,緯度:24.495804541670,流量:1000}
,
{"編號":"49","鄉鎮":"金沙鎮","地址":"大地公車亭旁","型式":"地上式",經度:118.459491021010,緯度:24.474506992942,流量:1020}
,
{"編號":"50","鄉鎮":"金沙鎮","地址":"田埔公車亭旁","型式":"地上式",經度:118.461607011461,緯度:24.476794035767,流量:840}
,
{"編號":"51","鄉鎮":"金沙鎮","地址":"林務所往823圓環","型式":"地上式",經度:118.436810070000,緯度:24.464962820000,流量:680}
,
{"編號":"1","鄉鎮":"金寧鄉","地址":"金寧消防分隊前","型式":"地上式",經度:118.328642129114,緯度:24.457782060077,流量:1656}
,
{"編號":"2","鄉鎮":"金寧鄉","地址":"沙崗農場站牌旁","型式":"地上式",經度:118.321116194105,緯度:24.469268505483,流量:1630}
,
{"編號":"3","鄉鎮":"金寧鄉","地址":"林厝圓環公園旁","型式":"地上式",經度:118.316948337175,緯度:24.474629232584,流量:932}
,
{"編號":"4","鄉鎮":"金寧鄉","地址":"林厝7號路旁","型式":"地下式",經度:118.315016353711,緯度:24.476879710137,流量:702}
,
{"編號":"5","鄉鎮":"金寧鄉","地址":"北山44號前","型式":"地上式",經度:118.311672516029,緯度:24.478635559987,流量:840}
,
{"編號":"6","鄉鎮":"金寧鄉","地址":"北山鎮西殿後方","型式":"地上式",經度:118.310489919771,緯度:24.480619433893,流量:770}
,
{"編號":"7","鄉鎮":"金寧鄉","地址":"南山公車站牌","型式":"地上式",經度:118.310463979036,緯度:24.480690912102,流量:350}
,
{"編號":"8","鄉鎮":"金寧鄉","地址":"南山6-2號旁","型式":"地上式",經度:118.307946332162,緯度:24.476941118564,流量:400}
,
{"編號":"9","鄉鎮":"金寧鄉","地址":"南山86號前","型式":"地上式",經度:118.303950329339,緯度:24.460285343338,流量:490}
,
{"編號":"10","鄉鎮":"金寧鄉","地址":"西浦頭祠堂後側","型式":"地上式",經度:118.317341085428,緯度:24.464892040202,流量:770}
,
{"編號":"11","鄉鎮":"金寧鄉","地址":"西浦頭11號前","型式":"地上式",經度:118.318133524964,緯度:24.465138306088,流量:1260}
,
{"編號":"12","鄉鎮":"金寧鄉","地址":"西埔頭1之1號前","型式":"地上式",經度:118.318871201435,緯度:24.465003223687,流量:1460}
,
{"編號":"13","鄉鎮":"金寧鄉","地址":"安岐公車候車亭旁","型式":"地上式",經度:118.324402003903,緯度:24.462658306687,流量:1264}
,
{"編號":"14","鄉鎮":"金寧鄉","地址":"慈湖路3段156號前","型式":"地上式",經度:118.306329896442,緯度:24.455487469784,流量:554}
,
{"編號":"15","鄉鎮":"金寧鄉","地址":"湖下老人會斜對面約30M","型式":"地上式",經度:118.306281161506,緯度:24.455363193207,流量:483}
,
{"編號":"16","鄉鎮":"金寧鄉","地址":"湖下村公所旁","型式":"地上式",經度:118.307220492102,緯度:24.456708066955,流量:1164}
,
{"編號":"17","鄉鎮":"金寧鄉","地址":"湖下222-1號前","型式":"地上式",經度:118.311916455912,緯度:24.439749033791,流量:1137}
,
{"編號":"18","鄉鎮":"金寧鄉","地址":"慈湖路1段213號前","型式":"地上式",經度:"",緯度:"",流量:1210}
,
{"編號":"19","鄉鎮":"金寧鄉","地址":"下埔下石碑旁","型式":"地上式",經度:118.316850584355,緯度:24.442678436878,流量:820}
,
{"編號":"20","鄉鎮":"金寧鄉","地址":"長鴻KTV門口前","型式":"地上式",經度:118.311903196123,緯度:24.439648214008,流量:488}
,
{"編號":"21","鄉鎮":"金寧鄉","地址":"埔邊2之3號前空地","型式":"地上式",經度:118.316985168393,緯度:24.439775076020,流量:238}
,
{"編號":"22","鄉鎮":"金寧鄉","地址":"埔後213號前","型式":"地上式",經度:118.321401217638,緯度:24.446781128039,流量:1147}
,
{"編號":"23","鄉鎮":"金寧鄉","地址":"埔後籃球場旁","型式":"地上式",經度:118.316912803806,緯度:24.442680704193,流量:498}
,
{"編號":"24","鄉鎮":"金寧鄉","地址":"金門大學體育館旁","型式":"地上式",經度:118.321464180266,緯度:24.446644987962,流量:737}
,
{"編號":"25","鄉鎮":"金寧鄉","地址":"金門大學大門口","型式":"地上式",經度:118.324574707208,緯度:24.447990816113,流量:584}
,
{"編號":"26","鄉鎮":"金寧鄉","地址":"金門大學旁新社區前","型式":"地上式",經度:118.327399467467,緯度:24.449802361594,流量:480}
,
{"編號":"27","鄉鎮":"金寧鄉","地址":"安岐11-8號前","型式":"地上式",經度:118.3271128,緯度:24.46226075,流量:1320}
,
{"編號":"28","鄉鎮":"金寧鄉","地址":"嚨口21號道路","型式":"地下式",經度:118.318860640759,緯度:24.465004349815,流量:270}
,
{"編號":"29","鄉鎮":"金寧鄉","地址":"后盤21號(老人休閒)前","型式":"地下式",經度:118.352788937099,緯度:24.451944610451,流量:450}
,
{"編號":"30","鄉鎮":"金寧鄉","地址":"中堡寶靈宮旁","型式":"地上式",經度:118.337668942272,緯度:24.458507421312,流量:800}
,
{"編號":"31","鄉鎮":"金寧鄉","地址":"頂堡介壽台旁","型式":"地上式",經度:118.339123187619,緯度:24.446680212696,流量:597}
,
{"編號":"32","鄉鎮":"金寧鄉","地址":"頂堡往東林汽車路上(籃球場旁)","型式":"地上式",經度:118.341144093260,緯度:24.446844774837,流量:544}
,
{"編號":"33","鄉鎮":"金寧鄉","地址":"盤山村公所後方","型式":"地上式",經度:118.338847905266,緯度:24.445113621835,流量:423}
,
{"編號":"34","鄉鎮":"金寧鄉","地址":"金寧鄉公所左後側","型式":"地上式",經度:118.334913082993,緯度:24.451115585684,流量:692}
,
{"編號":"35","鄉鎮":"金寧鄉","地址":"更生保護會左側","型式":"地上式",經度:118.335248896039,緯度:24.451947426448,流量:1523}
,
{"編號":"36","鄉鎮":"金寧鄉","地址":"仁愛新村69號左側","型式":"地上式",經度:118.334489921851,緯度:24.452549458081,流量:1312}
,
{"編號":"37","鄉鎮":"金寧鄉","地址":"湖南村莊口","型式":"地上式",經度:118.332915777796,緯度:24.453632277766,流量:507}
,
{"編號":"38","鄉鎮":"金寧鄉","地址":"金霸王KＴＶ斜對面","型式":"地上式",經度:118.335417770662,緯度:24.439831452946,流量:648}
,
{"編號":"39","鄉鎮":"金寧鄉","地址":"榜林圓環旁","型式":"地上式",經度:118.330435453154,緯度:24.438737057634,流量:690}
,
{"編號":"40","鄉鎮":"金寧鄉","地址":"鐵腳金門刀對面","型式":"地上式",經度:118.327973982657,緯度:24.436148824198,流量:230}
,
{"編號":"41","鄉鎮":"金寧鄉","地址":"東洲石牌十字路口地上式","型式":"地上式",經度:118.330150072440,緯度:24.431955185066,流量:1230}
,
{"編號":"42","鄉鎮":"金寧鄉","地址":"上、下后垵丁字路口","型式":"地下式",經度:118.328920687575,緯度:24.425048048788,流量:650}
,
{"編號":"43","鄉鎮":"金寧鄉","地址":"后湖林湖路與環島南路交叉口","型式":"地上式",經度:118.336258038821,緯度:24.420081411520,流量:1060}
,
{"編號":"44","鄉鎮":"金寧鄉","地址":"后湖15號旁","型式":"地上式",經度:118.340515490256,緯度:24.418750775639,流量:960}
,
{"編號":"45","鄉鎮":"金寧鄉","地址":"后湖垵湖分校前","型式":"地上式",經度:118.3408495534,緯度:24.4199111529,流量:550}
,
{"編號":"46","鄉鎮":"金寧鄉","地址":"中心教練場外","型式":"地上式",經度:118.341673218351,緯度:24.422703969073,流量:470}
,
{"編號":"47","鄉鎮":"金寧鄉","地址":"金山公墓門口","型式":"地上式",經度:118.338963652025,緯度:24.426545236409,流量:1230}
,
{"編號":"48","鄉鎮":"金寧鄉","地址":"殯儀館前","型式":"地上式",經度:118.339558130929,緯度:24.428467870003,流量:1392}
,
{"編號":"49","鄉鎮":"金寧鄉","地址":"納骨堂旁","型式":"地上式",經度:118.341177462615,緯度:24.429530020144,流量:1382}
,
{"編號":"50","鄉鎮":"金寧鄉","地址":"昔果山圓環旁","型式":"地上式",經度:118.346483644697,緯度:24.430054664478,流量:690}
,
{"編號":"51","鄉鎮":"金寧鄉","地址":"盤果路金城公墓旁","型式":"地上式",經度:118.342470258458,緯度:24.438893679288,流量:392}
,
{"編號":"52","鄉鎮":"金寧鄉","地址":"盤果路近聖祖貢糖","型式":"地上式",經度:118.341026992640,緯度:24.440305801503,流量:366}
,
{"編號":"53","鄉鎮":"金寧鄉","地址":"盤果路38號旁","型式":"地上式",經度:118.337967711546,緯度:24.443613543125,流量:667}
,
{"編號":"54","鄉鎮":"金寧鄉","地址":"下堡9之2號旁","型式":"地上式",經度:118.341091709545,緯度:24.440434651564,流量:603}
,
{"編號":"1","鄉鎮":"烈嶼鄉","地址":"烈嶼消防分隊車庫旁","型式":"地上式",經度:118.241766,緯度:24.427988,流量:686}
,
{"編號":"2","鄉鎮":"烈嶼鄉","地址":"烈嶼警察所對面路邊","型式":"地上式",經度:118.242727,緯度:24.432792,流量:1200}
,
{"編號":"3","鄉鎮":"烈嶼鄉","地址":"后宅轉彎大榕樹旁","型式":"地上式",經度:118.245981,緯度:24.439350,流量:1363}
,
{"編號":"4","鄉鎮":"烈嶼鄉","地址":"埔頭社區石牌旁","型式":"地上式",經度:118.247310,緯度:24.445726,流量:870}
,
{"編號":"5","鄉鎮":"烈嶼鄉","地址":"林邊村口村牌前方","型式":"地上式",經度:118.249572,緯度:24.446633,流量:870}
,
{"編號":"6","鄉鎮":"烈嶼鄉","地址":"黃厝-舊野戰醫院後方","型式":"地上式",經度:118.253691,緯度:24.446756,流量:716}
,
{"編號":"7","鄉鎮":"烈嶼鄉","地址":"后頭53號前(舊營區內）","型式":"地上式",經度:118.258981,緯度:24.440550,流量:713}
,
{"編號":"8","鄉鎮":"烈嶼鄉","地址":"后頭38-3號前","型式":"地上式",經度:118.259983,緯度:24.439350,流量:976}
,
{"編號":"9","鄉鎮":"烈嶼鄉","地址":"南塘11號前(湘園)","型式":"地上式",經度:118.238416,緯度:24.424840,流量:533}
,
{"編號":"10","鄉鎮":"烈嶼鄉","地址":"楊厝3-1號","型式":"地上式",經度:118.232045,緯度:24.419371,流量:760}
,
{"編號":"11","鄉鎮":"烈嶼鄉","地址":"上岐國小後側","型式":"地上式",經度:118.228837,緯度:24.415992,流量:820}
,
{"編號":"12","鄉鎮":"烈嶼鄉","地址":"青岐16號前","型式":"地上式",經度:118.227701,緯度:24.413635,流量:740}
,
{"編號":"13","鄉鎮":"烈嶼鄉","地址":"青岐42號前","型式":"地上式",經度:118.226101,緯度:24.413249,流量:657}
,
{"編號":"14","鄉鎮":"烈嶼鄉","地址":"青岐62號歡樂城前","型式":"地上式",經度:118.224115,緯度:24.413316,流量:651}
,
{"編號":"15","鄉鎮":"烈嶼鄉","地址":"青岐50號旁轉角","型式":"地上式",經度:118.225470,緯度:24.414048,流量:813}
,
{"編號":"16","鄉鎮":"烈嶼鄉","地址":"上岐村公所前右側轉角","型式":"地上式",經度:118.226346,緯度:24.414541,流量:844}
,
{"編號":"17","鄉鎮":"烈嶼鄉","地址":"貴山三角路口","型式":"地下式",經度:118.220217,緯度:24.422646,流量:394}
,
{"編號":"18","鄉鎮":"烈嶼鄉","地址":"上庫公車站前","型式":"地上式",經度:118.230993,緯度:24.423185,流量:482}
,
{"編號":"19","鄉鎮":"烈嶼鄉","地址":"上林村社區造景前","型式":"地上式",經度:118.232064,緯度:24.427287,流量:703}
,
{"編號":"20","鄉鎮":"烈嶼鄉","地址":"上林51號旁","型式":"地上式",經度:118.230394,緯度:24.428165,流量:706}
,
{"編號":"21","鄉鎮":"烈嶼鄉","地址":"后井12號旁","型式":"地上式",經度:118.241026,緯度:24.429844,流量:829}
,
{"編號":"22","鄉鎮":"烈嶼鄉","地址":"中墩12號右側","型式":"地上式",經度:118.233019,緯度:24.434017,流量:950}
,
{"編號":"23","鄉鎮":"烈嶼鄉","地址":"雙口32-1號左前側","型式":"地上式",經度:118.230985,緯度:24.440412,流量:1375}
,
{"編號":"24","鄉鎮":"烈嶼鄉","地址":"西方街尾(公車亭前)","型式":"地上式",經度:118.236871,緯度:24.435164,流量:1850}
,
{"編號":"25","鄉鎮":"烈嶼鄉","地址":"西方街第一路段路口","型式":"地上式",經度:118.237416,緯度:24.434410,流量:700}
,
{"編號":"26","鄉鎮":"烈嶼鄉","地址":"西方街入口","型式":"地上式",經度:118.238016,緯度:24.434036,流量:1400}
,
{"編號":"27","鄉鎮":"烈嶼鄉","地址":"西方公車站牌前(營區前)","型式":"地上式",經度:118.239556,緯度:24.434580,流量:1400}
,
{"編號":"28","鄉鎮":"烈嶼鄉","地址":"東林151號旁(計程車站)","型式":"地上式",經度:118.247410,緯度:24.428347,流量:900}
,
{"編號":"29","鄉鎮":"烈嶼鄉","地址":"東林發福修車廠旁","型式":"地上式",經度:118.248561,緯度:24.427415,流量:863}
,
{"編號":"30","鄉鎮":"烈嶼鄉","地址":"東林尾（東林石牌旁）","型式":"地上式",經度:118.249834,緯度:24.426506,流量:1123}
,
{"編號":"31","鄉鎮":"烈嶼鄉","地址":"東林89號三寶禮品前","型式":"地下式",經度:118.247990,緯度:24.427976,流量:800}
,
{"編號":"32","鄉鎮":"烈嶼鄉","地址":"東林14-1號前","型式":"地上式",經度:118.249330,緯度:24.427895,流量:680}
,
{"編號":"33","鄉鎮":"烈嶼鄉","地址":"東林27號前(詠聲唱片後方)","型式":"地下式",經度:118.248792,緯度:24.428046,流量:730}
,
{"編號":"34","鄉鎮":"烈嶼鄉","地址":"東林林氏家廟左前方","型式":"地下式",經度:118.248949,緯度:24.428646,流量:470}
,
{"編號":"35","鄉鎮":"烈嶼鄉","地址":"東林67號前中正台右側","型式":"地下式",經度:118.248476,緯度:24.429136,流量:840}
,
{"編號":"36","鄉鎮":"烈嶼鄉","地址":"西宅17號龍泉商店前","型式":"地下式",經度:118.247819,緯度:24.430117,流量:860}
,
{"編號":"37","鄉鎮":"烈嶼鄉","地址":"湖下公車站前右側","型式":"地上式",經度:118.256775,緯度:24.426606,流量:700}
,
{"編號":"38","鄉鎮":"烈嶼鄉","地址":"國家公園旅客服務中心後側停車場","型式":"地上式",經度:118.262066,緯度:24.424212,流量:550}
,
{"編號":"39","鄉鎮":"烈嶼鄉","地址":"濱海道國家公園往九宮坑道西側入口段","型式":"地上式",經度:118.261130,緯度:24.423145,流量:1122}
,
{"編號":"40","鄉鎮":"烈嶼鄉","地址":"東崗海水浴場觀景台後側","型式":"地上式",經度:118.251908,緯度:24.425056,流量:1126}
,
{"編號":"41","鄉鎮":"烈嶼鄉","地址":"東崗習山湖公園前方","型式":"地上式",經度:118.249963,緯度:24.424537,流量:1336}
,
{"編號":"42","鄉鎮":"烈嶼鄉","地址":"前埔6號對面","型式":"地上式",經度:118.234806,緯度:24.427851,流量:830}
,
{"編號":"43","鄉鎮":"烈嶼鄉","地址":"西口國小大門前路口","型式":"地上式",經度:118.236372,緯度:24.436175,流量:1610}
,
{"編號":"44","鄉鎮":"烈嶼鄉","地址":"下田公車亭旁","型式":"地上式",經度:118.235010,緯度:24.437860,流量:1840}
,
{"編號":"45","鄉鎮":"烈嶼鄉","地址":"東坑公車亭旁","型式":"地上式",經度:118.232290,緯度:24.443005,流量:1280}
,
{"編號":"46","鄉鎮":"烈嶼鄉","地址":"湖井頭戰史館停車場入口旁","型式":"地上式",經度:118.231622,緯度:24.446442,流量:1590}
,
{"編號":"47","鄉鎮":"烈嶼鄉","地址":"庵下石牌旁","型式":"地上式",經度:"",緯度:"",流量:1480}

];
 
var map;
var markers = [];
var a = -1;

function initMap() {
  const directionsService = new google.maps.DirectionsService();
  const directionsRenderer = new google.maps.DirectionsRenderer();
  const geocoder = new google.maps.Geocoder();
  map = new google.maps.Map(document.getElementById('map'), {
    zoom: 16,
    center: {lat: 24.4586876, lng: 118.3863567},
    zoomControl: false,    
    scaleControl: true,
    fullscreenControl: false,
    mapTypeControl: true,
    mapTypeControlOptions: {
      style: google.maps.MapTypeControlStyle.HORIZONTAL_BAR,
      position: google.maps.ControlPosition.LEFT_BOTTOM,},
    gestureHandling: "greedy",
  });
  

  directionsRenderer.setMap(map);
  
  const onChangeHandler = function () {
    calculateAndDisplayRoute(directionsService, directionsRenderer);
  };
  document.getElementById("start").addEventListener("change", onChangeHandler);
  document.getElementById("combobox").addEventListener("change", onChangeHandler);
  
  for (var i = 0; i <position.length; i++) {
    addMarker(i);  
  };
  

  
  
  
  
  
}

function addMarker(e) {
  markers[e] = new google.maps.Marker({
    position: {
      lat: position[e].緯度,
      lng: position[e].經度
    },
    icon:{
      url:"https://github.com/biglan-1234/googlemap/blob/master/fire1.png?raw=true",
      scaledSize: new google.maps.Size(40, 40),
      labelOrigin:new google.maps.Point(50,-10),
               },    
    map: map,
    
  });
  var infowindow = new google.maps.InfoWindow({
   content:'<IMG SRC="https://github.com/biglan-1234/googlemap/blob/master/fire1.png?raw=true" width=30px height=30px>'+position[e].編號+'----'+
            position[e].型式+'<br>'+
            position[e].鄉鎮+'<br>'+
            position[e].地址+'<br>'+
           '出水量: '+position[e].流量+"&nbsp&nbsp公升/每分鐘"+'<br>'+
           '經度: '+position[e].經度+'<br>'+
           '緯度" '+position[e].緯度,
    position: {
      lat: position[e].緯度,
      lng: position[e].經度
    },
    
  });
 
  
   markers[e].addListener('click',function(){
    a = a * -1;
    if(a > 0){
      infowindow.open(map, markers[e]);
    }else{
      infowindow.close();
    }
  });
  
 
 
  
  
  
}

function calculateAndDisplayRoute(directionsService, directionsRenderer) {
  directionsService.route(
    {
      origin: {
        query: document.getElementById("start").value,
      },
      destination: {
        query: document.getElementById("combobox").value,
      },
      travelMode: google.maps.TravelMode.DRIVING,
    },
    (response, status) => {
      if (status === "OK") {
        directionsRenderer.setDirections(response);
      } else {
        window.alert("Directions request failed due to " + status);
      }
    }
  );
}
